package Section_7_OOP_Part_1_Inheritance.CodingExercise_30_to_37.Ex_34_Carpet_Cost_Calculator;

public class Calculator {

    private Floor floor;
    private Carpet carpet;

    public Calculator(Floor floor, Carpet carpet) {
        this.floor = floor;
        this.carpet = carpet;
    }

    public double getTotalCost() {
        return floor.getArea() * carpet.getCost();
    }
}

/*

**********************EXPLANATION TO UKRAINIAN********************************************************************************
Клас Calculator - це клас, який виконує обчислення та зберігає інформацію про об'єкти типу Floor та Carpet.

У класі Calculator є два приватних поля:

floor - об'єкт типу Floor, який представляє підлогу кімнати, для якої ми розраховуємо вартість килиму.
carpet - об'єкт типу Carpet, який представляє килим, який буде використовуватись для покриття підлоги кімнати.
Ці поля є приватними, тому що ми не хочемо, щоб зовнішні класи могли безпосередньо змінювати їх значення. Замість цього,
ми використовуємо конструктор класу Calculator, щоб передати об'єкти floor та carpet з інших класів.

Конструктор класу Calculator має два параметри:

floor - об'єкт типу Floor, який буде використовуватись для розрахунку вартості покриття підлоги.
carpet - об'єкт типу Carpet, який буде використовуватись для розрахунку вартості килиму.
При створенні об'єкту класу Calculator, ми передаємо в нього створені об'єкти класів Floor та Carpet з інших класів за
допомогою їх конструкторів.
Таким чином, об'єкти floor та carpet передаються в клас Calculator за допомогою його конструктора. Після цього ми можемо
використовувати ці об'єкти для обчислення вартості покриття підлоги килимом.


Клас Calculator не наслідує змінні екземплярів з інших класів. Замість цього, він має дві приватні змінні екземпляру -
floor та carpet - які посилаються на об'єкти класів Floor та Carpet відповідно. Це називається композицією - клас
Calculator складається з об'єктів інших класів, які він використовує для виконання своєї функції. Об'єкти цих класів
передаються в конструктор класу Calculator як параметри.


*/
